Repository: gentoo/gentoo
Catalog: net-dialup/gtkterm/files/*.po
Languages: ru

source: ERROR : Buffer is not initialized !
ru: ОШИБКА : Буфер не инициализирован!

source: GTKTerm version %s
ru: GTKTerm версия %s

source: http://www.jls-info.com/julien/linux
ru: http://www.jls-info.com/julien/linux/index_fr.html

source: This program is released under the terms of the GPL V.2
ru: Программа распространяется на условиях лицензии GPL V.2

source: ** Use at your own risks ! **
ru: ** Используйте на свой риск ! **

source: Command line options
ru: Опции командной строки

source: --help or -h : this help screen
ru: --help or -h : показать это окно помощи

source: --config <configuration> or -c : load configuration
ru: --config <configuration> или -c : загрузка конфигурации

source: --port <device> or -p : serial port device (default /dev/ttyS0)
ru: --port <device> или -p : последовательный порт (/dev/ttyS0 по умолчанию)

source: --speed <speed> or -s : serial port speed (default 9600)
ru: --speed <speed> или -s : скорость порта (9600 по умолчанию)

source: --bits <bits> or -b : number of bits (default 8)
ru: --bits <bits> или -b : число бит (8 по умолчанию)

source: --stopbits <stopbits> or -t : number of stopbits (default 1)
ru: --stopbits <stopbits> или -t : число стоповых бит (1 по умолчанию)

source: --parity <odd | even> or -a : partity (default none)
ru: --parity <odd | even> или -a : чётность (нет по умолчанию)

source: --flow <Xon | CTS> or -w : flow control (default none)
ru: --flow <Xon | CTS> или -w : контроль потока (нет по умолчанию)

source: --delay <ms> or -d : end of line delay in ms (default none)
ru: --delay <ms> или -d : задержка окончания строки в ms (нет по умолчанию)

source: --char <char> or -r : wait for a special char at end of line (default none)
ru: --char <char> или -r : ожидание специального символа для окончания строки (нет по умолчанию)

source: --file <filename> or -f : default file to send (default none)
ru: --file <filename> или -f : файл для отправки (нет по умолчанию)

source: --echo or -e : switch on local echo
ru: --echo или -e : локальное эхо

source: Misunderstood command line option
ru: Неизвестный параметр командной строки

source: No valid serial device found in /dev, sorry ! You should have at least one of these : /dev/ttyS* /dev/tts/* /dev/ttyUSB* /dev/usb/tts/*
ru: Нет доступных последовательных устройств в /dev, извините ! Необходимо иметь хотя бы один порт: /dev/ttyS* /dev/tts/* /dev/ttyUSB* /dev/usb/tts/*

source: Configuration
ru: Конфигурация

source: Serial port
ru: Последовательный порт

source: Port :
ru: Порт :

source: Speed :
ru: Скорость :

source: Parity :
ru: Чётность :

source: Bits :
ru: Бит :

source: Stopbits :
ru: Стоповых бит:

source: Flow control :
ru: Контроль передачи :

source: ASCII file transfer
ru: Передача файла ASCII

source: End of line delay (milliseconds) :
ru: Задержка конца строки в милисекундах :

source: Wait for this special character before passing to next line :
ru: Ожидание специального символа до начала следующей строки :

source: No open port
ru: Нет открытых портов

source: Font selection
ru: Выбор шрифта

source: Load configuration
ru: Загрузить конфигурацию

source: Delete configuration
ru: Удалить конфигурацию

source: Cannot read configuration file !
ru: Не могу прочитать файл конфигурации !

source: Configurations
ru: Конфигурация

source: Save configuration
ru: Сохранить конфигурацию

source: Configuration name :
ru: Имя конфигурации :

source: Cannot overwrite section !
ru: Невозможно перезаписать секцию !

source: Cannot read configuration file !
ru: Не могу прочитать файл конфигурации !

source: Configuration [%s] saved
ru: Конфигурация [%s] сохранена

source: Warning !
ru: Внимание !

source: Section [%s] already exists Do you want to overwrite it ?
ru: Секция [%s] уже существует. Вы хотите её перезаписать ?

source: Cannot delete section !
ru: Невозможно удалить секцию !

source: No section "%s" in configuration file
ru: Секция "%s" отсутствует в файле конфигурации

source: Unknown speed : %d bauds Falling back to default speed : %d bauds
ru: Неверная скорость : %d Используется значение по умолчанию : %d

source: Impossible stopbits number : %d Falling back to default stop bits number : %d
ru: Неверное число стоповых бит : %d Используется значение по умолчанию : %d

source: Impossible bits number : %d Falling back to default stop bits : %d
ru: Неверное число бит : %d Используется значение по умолчанию : %d

source: Impossible delay : %d ms Falling back to default delay : %d ms
ru: Неверная величина задержки : %d ms Используется значение по умолчанию : %d ms

source: Configuration file (%s) with [default] configuration has been created.
ru: Файл конфигурации %s по умолчанию [default] создан.

source: Cannot find section %s
ru: Не могу найти секцию %s

source: Terminal configuration
ru: Конфигурация терминала

source: File selection
ru: Выбор файла

source: Error opening file
ru: Ошибка открытия файла

source: %s : transfer in progress...
ru: %s : передача...

source: %v / %u Kb (%p %%)
ru: %v / %u Кб (%p %%)

source: %v / %u bytes (%p %%)
ru: %v / %u байт (%p %%)

source: Cancel
ru: Отмена

source: Cannot read file %s : %s
ru: Не могу прочитать файл %s : %s

source: Cannot write file %s
ru: Не могу записать файл %s

source: File error
ru: Ошибка файла

source: Cannot open file %s : %s
ru: Не могу открыть файл %s : %s

source: Macro "%s" sent !
ru: Макрос "%s" отправлен !

source: Shortcut
ru: Быстрая клавиша

source: Help on macros
ru: Справка по макросам

source: The "action" field of a macro is the data to be sent on the port. Text can be entered, but also special chars, like \n, \t, \r, etc. You can also enter hexadecimal data preceded by a '\'. The hexadecimal data should not begin with a letter (eg. use \0FF and not \FF) Examples : "Hello\n" sends "Hello" followed by a Line Feed "Hello\0A" does the same thing but the LF is entered in hexadecimal
ru: Поле "action" это данные для отправки в порт. Может содержать текст и специальные символы, такие как \n, \t, \r, и.т.д. Также возможно использование двоичных данных с символом '\'. Двоичные данные не должны начинаться с буквы, т.е. используйте \0FF вместо \FF Примеры : "Привет\n" отправляет "Привет" завершая символом конца строки "Привет\0A" тот же самы пример, но символ конца строки введен как двоичное число.

source: Configure Macros
ru: Конфигурирование макросов

source: _Add
ru: _Добавить

source: _Delete
ru: _Удалить

source: _Capture Shortcut
ru: _Установить быструю клавишу

source: Cannot open configuration file `%s'.
ru: Не могу открыть файл конфигурации `%s'.

source: Cannot create configuration file `%s'.
ru: Не могу создать файл конфигурации `%s'.

source: %s(%d): %s Syntax error
ru: %s(%d): %s Синтаксическая ошибка

source: %s(%d): %s Unrecognized parameter
ru: %s(%d): %s Неизвестный параметр

source: %s(%d): %s Internal error
ru: %s(%d): %s Внутренняя ошибка

source: %s(%d): %s Invalid number
ru: %s(%d): %s Неверный номер

source: %s(%d): %s Out of range
ru: %s(%d): %s Выход за пределы

source: %s(%d): %s Cannot allocate memory.
ru: %s(%d): %s Невозвожно выделить память.

source: %s(%d): %s It must be specified TRUE or FALSE.
ru: %s(%d): %s Должно быть указано TRUE или FALSE.

source: %s(%d): %s The section name is already used.
ru: %s(%d): %s Имя секции уже используется.

source: %s(%d) There is no closing brace.
ru: %s(%d) Не закрыты кавычки.

source: %s(%d): %s Unexplained error
ru: %s(%d): %s Неизвестная ошибка

source: Cannot open %s : %s
ru: Не могу открыть %s : %s

source: Control signals read
ru: Чтение сигналов управления

source: DTR write
ru: Установка DTR

source: RTS write
ru: Установка RTS

source: Lockfile is stale. Overriding it..
ru: Lockfile устарел. Перезапись...

source: Device %s is locked.
ru: Устройство %s залочено.

source: Cannot create lockfile. Sorry.
ru: Не могу создать Lockfile, извините

source: /_File
ru: _Файл

source: /File/Clear screen
ru: /Файл/Очистить _экран

source: /File/Send _raw file
ru: /Файл/_Отправить файл

source: /File/_Save raw file
ru: /Файл/_Сохранить в файл

source: /File/Separator
ru: /Файл/Separator

source: /File/E_xit
ru: /Файл/_Выход

source: /_Configuration
ru: /_Конфигурация

source: /Configuration/_Port
ru: /Конфигурация/_Порт

source: /Configuration/Local _echo
ru: /Конфигурация/_Локальное эхо

source: /Configuration/_Macros
ru: /Конфигурация/_Макросы

source: /Configuration/Separator
ru: /Конфигурация/Separator

source: /Configuration/_Load configuration
ru: /Конфигурация/_Загрузить конфигурацию

source: /Configuration/_Save configuration
ru: /Конфигурация/_Сохранить конфигурацию

source: /Configuration/_Delete configuration
ru: /Конфигурация/_Удалить конфигурацию

source: /Control _signals
ru: /_Сигналы управления

source: /Control signals/Send break
ru: /Сигналы управления/Послать BREAK

source: /Control signals/Toggle DTR
ru: /Сигналы управления/Переключить DTR

source: /Control signals/Toggle RTS
ru: /Сигналы управления/Переключить RTS

source: /_View
ru: /_Вид

source: /View/_ASCII
ru: /Вид/_ASCII

source: /View/_Hexadecimal
ru: /Вид/_Двоичное

source: /View/Hexadecimal _chars
ru: /Вид/_Размер двоичных данных

source: /View/Hexadecimal chars/_8
ru: /Вид/Размер двоичных данных/_8

source: /View/Hexadecimal chars/1_0
ru: /Вид/Размер двоичных данных/1_0

source: /View/Hexadecimal chars/_16
ru: /Вид/Размер двоичных данных/_16

source: /View/Hexadecimal chars/_24
ru: /Вид/Размер двоичных данных/_24

source: /View/Hexadecimal chars/_32
ru: /Вид/Размер двоичных данных/_32

source: /View/Show _index
ru: /Вид/Показать _адрес

source: /View/Separator
ru: /Вид/Separator

source: /View/_Send hexadecimal data
ru: /Вид/Отправка _двоичных данных

source: /_Help
ru: _Справка

source: /Help/_About...
ru: /Справка/_О программе...

source: Hexadecimal data to send (separator : ';' or space) :
ru: Отправка двоичных данных (разделитель : ';' или пробел) :

source: About...
ru: О программе...

source: <big><i> GTKTerm V. %s </i></big> (c) Julien Schmitt : julien@jls-info.com http://www.jls-info.com/julien/linux
ru: <big><i> GTKTerm V. %s </i></big> (c) Julien Schmitt : julien@jls-info.com http://www.jls-info.com/julien/linux/index_fr.html

source: Break signal sent !
ru: Отправлен сигнал BREAK !

source: "%s" : %d byte(s) sent !
ru: "%s" : %d байт отправлено !
